// morning-journal-data.js
window.morningJournalEntries = [
  {
    "id": "2025-06-08",
    "date": "2025-06-08",
    "harvest": "<p>1. 因为每天都要写日记，现在都用的是手机备忘录在记录，资料无法有效转换，刚好最近学习AI编程，来做一个属于自己的网站+晨间日记功能，整体功能已正常实现，大致功能有: 日记输入，设定目标，输出文文档等，也有简单针对字体修改的功能，详细内容可以参考一下小红书的视频。</p><p>2. 练习了一下AI简历的操作，依据SOP修改了原本的档案，基本上整个流程已经学会，剩下的就是不断地实操增加经验，也学习如何让自己的简历更加吸引人。</p><p>3. 因为工作上的需求，常常需要做PPT，也尝试了AI PPT的制作，学会整个流程后，做PPT是很快的但是工作上的PPT常常需要着墨半天，比如如何把50页PPT的内容浓缩成1-2页的图表呈现，这部份现有的PPT工具可能无法实现，继续研究。</p>",
    "plan": "<p>1. 准备开始视频出海的行动营\n<br>2. AI编程的世界真的很有趣，思考如何结合目前要做的事情</p>",
    "gratitude": "<p>感谢加入老徐、大冲跟张老板，这些活动真的非常有意思而且让自己热在其中，有管道可以尝试，有问题可以请教，有产出可以发布，大家都是努力的让自己越过越开心，这种感觉很好</p>",
    "investment": "<p>1.每天一句越南语练习( 80/365)\n<br>\n<br>2.日更睡前故事影片(44/365)</p>",
    "connect": "<p>我的公众号: #贺伯谈AI</p><p>我的视频号: #贺伯谈AI</p><p>我的小红书: #贺伯谈AI</p>"
  },
  {
    "id": "2025-06-07",
    "date": "2025-06-07",
    "harvest": "<p>1. 今天把之前做的AI编程小工具汇整了一下，并把个人网页设计完成，相关的资讯已更新到git hub的网站上( 有需要相关教程的小伙伴，请私我)</p><p>2. 个人网站正式上线，因为包含了很多内容，所以自己申请了免费的git hub来更新，过程比较繁琐，写了一个教程，跟着一步一步执行，也是蛮容易的，过程中有问题，直接问AI，可以很好的解答并完成</p><p>3.AI编程真的很有趣，学习了大概2周左右，竟然可以做出这些东西，真的令人感到兴奋，也许不是特别专业，但是已经可以抓一些垂直的需求来运作，这就是一般人学习AI编程的目的，编程已经不在是那样的遥不可及</p>",
    "plan": "<p>1. 持续完善个人网站</p><p>2. AI编程持续钻研，加入老徐AI编程星球</p><p>3. 出海活动展开，目标活动期间开通YPP</p>",
    "gratitude": "<p>感谢每天自己的进步，从当初完全小白开始，每天花一点时间钻研，目前已经可以解决大部分的前端需求，期待后面的插件开发与小程序跟IOS APP，今年就是结合这几个方向用力做</p>",
    "investment": "<p>1.每天一句越南语练习(80/365)</p><p>请给我袋子 — Cho tôi túi nhé.</p><p>2.日更睡前故事影片(44/365)</p>",
    "connect": "<p>我的公众号: #贺伯谈AI\n<br>我的视频号: #贺伯谈AI\n<br>我的小红书: #贺伯谈AI</p>"
  },
  {
    "id": "2025-06-04",
    "date": "2025-06-04",
    "harvest": "<p>1. 今天把之前做的AI编程小工具汇整了一下，并把个人网页设计完成，相关的资讯已更新到git hub的网站上( 有需要相关教程的小伙伴，请私我)</p><p>2. 个人网站正式上线，因为包含了很多内容，所以自己申请了免费的git hub来更新，过程比较繁琐，写了一个教程，跟着一步一步执行，也是蛮容易的，过程中有问题，直接问AI，可以很好的解答并完成</p><p>3.AI编程真的很有趣，学习了大概2周左右，竟然可以做出这些东西，真的令人感到兴奋，也许不是特别专业，但是已经可以抓一些垂直的需求来运作，这就是一般人学习AI编程的目的，编程已经不在是那样的遥不可及</p>",
    "plan": "<p>1. 持续完善个人网站</p><p>2. AI编程持续钻研，加入老徐AI编程星球</p><p>3. 出海活动展开，目标活动期间开通YPP</p>",
    "gratitude": "<p>感谢每天自己的进步，从当初完全小白开始，每天花一点时间钻研，目前已经可以解决大部分的前端需求，期待后面的插件开发与小程序跟IOS APP，今年就是结合这几个方向用力做</p>",
    "investment": "<p>1.每天一句越南语练习(80/365)</p><p>请给我袋子 — Cho tôi túi nhé.</p><p>2.日更睡前故事影片(44/365)</p>",
    "connect": "<p>我的公众号: #贺伯谈AI\n<br>我的视频号: #贺伯谈AI\n<br>我的小红书: #贺伯谈AI</p>"
  },
  {
    "id": "2025-06-03",
    "date": "2025-06-03",
    "harvest": "<p>1. 因为每天都要写日记，现在都用的是手机备忘录在记录，资料无法有效转换，刚好最近学习AI编程，来做一个属于自己的网站+晨间日记功能，整体功能已正常实现，大致功能有: 日记输入，设定目标，输出文文档等，也有简单针对字体修改的功能，详细内容可以参考一下小红书的视频。</p><p>2. 练习了一下AI简历的操作，依据SOP修改了原本的档案，基本上整个流程已经学会，剩下的就是不断地实操增加经验，也学习如何让自己的简历更加吸引人。</p><p>3. 因为工作上的需求，常常需要做PPT，也尝试了AI PPT的制作，学会整个流程后，做PPT是很快的但是工作上的PPT常常需要着墨半天，比如如何把50页PPT的内容浓缩成1-2页的图表呈现，这部份现有的PPT工具可能无法实现，继续研究。</p>",
    "plan": "<p>1. 准备开始视频出海的行动营\n<br>2. AI编程的世界真的很有趣，思考如何结合目前要做的事情</p>",
    "gratitude": "<p>感谢加入老徐、大冲跟张老板，这些活动真的非常有意思而且让自己热在其中，有管道可以尝试，有问题可以请教，有产出可以发布，大家都是努力的让自己越过越开心，这种感觉很好</p>",
    "investment": "<p>1.每天一句越南语练习( 80/365)\n<br>\n<br>2.日更睡前故事影片(44/365)</p>",
    "connect": "<p>我的公众号: #贺伯谈AI</p><p>我的视频号: #贺伯谈AI</p><p>我的小红书: #贺伯谈AI</p>"
  },
  {
    "id": "2025-06-02",
    "date": "2025-06-02",
    "harvest": "1. 六一儿童节用AI编程做了一个简单的小游戏，<b>体验了一把deepseek v1 新版本编程的功力</b><div>2. 跟老朋友聚餐，了解大家最近的状况</div><div>3. 学习透过AI修改简历跟制作PPT</div>",
    "plan": "<p>1. 准备开始视频出海的行动营</p><p>2. 阅读并整理相关资料，接下来的日子应该是很充实</p>",
    "gratitude": "返台后约很久不见的朋友约聚餐，都是二十多年的好朋友，感谢我们的友情长存",
    "investment": "<p>1.每天一句越南语练习( 79/365)</p><p><br></p><p>2.日更睡前故事影片(44/365)</p>",
    "connect": "<p>我的公众号: #贺伯谈AI</p><p>我的视频号: #贺伯谈AI</p>"
  },
  {
    "id": "2025-06-01",
    "date": "2025-06-01",
    "harvest": "<p>1. 六一儿童节用AI编程做了一个简单的小游戏，体验了一把deepseek v1 新版本编程的功力2. 跟老朋友聚餐，了解大家最近的状况<br>3. 学习透过AI修改简历跟制作PPT</p>",
    "plan": "<p>1. 准备开始视频出海的行动营<br>2. 阅读并整理相关资料</p>",
    "gratitude": "<p>返台后约很久不见的朋友约聚餐，都是二十多年的好朋友，感谢我们的友情长存</p>",
    "investment": "<p>1.每天一句越南语练习( 78/365)<br><br>2.日更睡前故事影片(44/365)</p>",
    "connect": "<p>我的公众号: #贺伯谈AI<br>我的视频号: #贺伯谈AI</p>"
  },
  {
    "id": "2025-05-31",
    "date": "2025-05-31",
    "harvest": "<p>1. 六一儿童节用AI编程做了一个简单的小游戏，体验了一把deepseek v1 新版本编程的功力2. 跟老朋友聚餐，了解大家最近的状况<br>3. 学习透过AI修改简历跟制作PPT</p>",
    "plan": "<p>1. 准备开始视频出海的行动营<br>2. 阅读并整理相关资料</p>",
    "gratitude": "<p>返台后约很久不见的朋友约聚餐，都是二十多年的好朋友，感谢我们的友情长存</p>",
    "investment": "<p>1.每天一句越南语练习( 79/365)<br><br>2.日更睡前故事影片(44/365)</p>",
    "connect": "<p>我的公众号: #贺伯谈AI<br>我的视频号: #贺伯谈AI</p>"
  }
];
